"""
可變對象
    - 每個對象都保存了三個數據:
        id(標誌)
        type(類型)
        value(值)
    - 列表就是一個可變對象
        a = [1, 2, 3]

    - a[0] = 10         (改對象)
       這個操作是通過變量去修改對象的值
       這個操作不會影響變量所指向的對象
       當我們去修改對象時，如果有其他變量也指向該對象，則修改也會在其他變量中體現
    - a = [10, 2, 3]    (改變量)
       這個操作是修改a變量指向的列表對象
       對變量賦值不會影響其他變量
    - 一般只有在為變量賦值時才是修改變量，其餘都是在修改對象
"""

a = [1, 2, 3]
print('a指向的對象=', id(a))
a[0] = 10
print('a指向的對象=', id(a))
a = [10, 2, 3]
print('a指向的對象=', id(a))

a = [1, 2, 3]
#b = a
b = a[:]
a.append(4)
print('b=', b)

# ==, !=, is, is not
# == , != 比較的是對象的值是否相等
# is , is not  比較的是對象的id是否相等
a = [1, 2, 3]
b = [1, 2, 3]
print('a==b?', a == b)   # a和b值相等，會返回True
print('a is b?', a is b) # a和b不是同一個對象，會返回False
b = a
print('a==b?', a == b)
print('a is b?', a is b)
